In [1]:
%reload_ext sql

In [2]:
%%sql mysql+pymysql://root:MyN3wP4ssw0rd@localhost:3306/balanced_tree

SELECT 1+1;

1 rows affected.

[(2,)]

# Four tables : Sales, Product_details, Product_hierarchy and Product_prices

In [3]:
%%sql
select * from sales limit 5

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
5 rows affected.

[('c4a632', 4, 13, 17, 't', '54f307', datetime.datetime(2021, 2, 13, 1, 59, 43)),
 ('5d267b', 4, 40, 17, 't', '54f307', datetime.datetime(2021, 2, 13, 1, 59, 43)),
 ('b9a74d', 4, 17, 17, 't', '54f307', datetime.datetime(2021, 2, 13, 1, 59, 43)),
 ('2feb6b', 2, 29, 17, 't', '54f307', datetime.datetime(2021, 2, 13, 1, 59, 43)),
 ('c4a632', 5, 13, 21, 't', '26cc98', datetime.datetime(2021, 1, 19, 1, 39))]

In [4]:
%%sql
SELECT * FROM   product_details LIMIT  5

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
5 rows affected.

[('c4a632', 13, 'Navy Oversized Jeans - Womens', 1, 3, 7, 'Womens', 'Jeans', 'Navy Oversized'),
 ('e83aa3', 32, 'Black Straight Jeans - Womens', 1, 3, 8, 'Womens', 'Jeans', 'Black Straight'),
 ('e31d39', 10, 'Cream Relaxed Jeans - Womens', 1, 3, 9, 'Womens', 'Jeans', 'Cream Relaxed'),
 ('d5e9a6', 23, 'Khaki Suit Jacket - Womens', 1, 4, 10, 'Womens', 'Jacket', 'Khaki Suit'),
 ('72f5d4', 19, 'Indigo Rain Jacket - Womens', 1, 4, 11, 'Womens', 'Jacket', 'Indigo Rain')]

In [5]:
%%sql
SELECT * FROM   product_hierarchy LIMIT  5

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
5 rows affected.

[(1, None, 'Womens', 'Category'),
 (2, None, 'Mens', 'Category'),
 (3, 1, 'Jeans', 'Segment'),
 (4, 1, 'Jacket', 'Segment'),
 (5, 2, 'Shirt', 'Segment')]

In [6]:
%%sql
select * from product_prices limit 5

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
5 rows affected.

[(7, 'c4a632', 13),
 (8, 'e83aa3', 32),
 (9, 'e31d39', 10),
 (10, 'd5e9a6', 23),
 (11, '72f5d4', 19)]

## A-1 What was the total quantity sold for all products?

In [7]:
%%sql
SELECT product_name, Sum(qty)
FROM   sales s
         LEFT JOIN product_details p
              ON s.prod_id = p.product_id
GROUP  BY 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
12 rows affected.

[('Navy Oversized Jeans - Womens', Decimal('3856')),
 ('White Tee Shirt - Mens', Decimal('3800')),
 ('White Striped Socks - Mens', Decimal('3655')),
 ('Pink Fluro Polkadot Socks - Mens', Decimal('3770')),
 ('Cream Relaxed Jeans - Womens', Decimal('3707')),
 ('Indigo Rain Jacket - Womens', Decimal('3757')),
 ('Blue Polo Shirt - Mens', Decimal('3819')),
 ('Navy Solid Socks - Mens', Decimal('3792')),
 ('Black Straight Jeans - Womens', Decimal('3786')),
 ('Khaki Suit Jacket - Womens', Decimal('3752')),
 ('Grey Fashion Jacket - Womens', Decimal('3876')),
 ('Teal Button Up Shirt - Mens', Decimal('3646'))]

## A-2 What is the total generated revenue for all products before discounts?

In [8]:
%%sql
SELECT product_name, Sum(s.price * s.qty * ( 1 - ( discount / 100 ) )) AS total_revenue
FROM   sales s
       LEFT JOIN product_details p
              ON s.prod_id = p.product_id
GROUP  BY 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
12 rows affected.

[('Navy Oversized Jeans - Womens', Decimal('43992.3900')),
 ('White Tee Shirt - Mens', Decimal('133622.4000')),
 ('White Striped Socks - Mens', Decimal('54724.1900')),
 ('Pink Fluro Polkadot Socks - Mens', Decimal('96377.7300')),
 ('Cream Relaxed Jeans - Womens', Decimal('32606.6000')),
 ('Indigo Rain Jacket - Womens', Decimal('62740.4700')),
 ('Blue Polo Shirt - Mens', Decimal('190863.9300')),
 ('Navy Solid Socks - Mens', Decimal('119861.6400')),
 ('Black Straight Jeans - Womens', Decimal('106407.0400')),
 ('Khaki Suit Jacket - Womens', Decimal('76052.9500')),
 ('Grey Fashion Jacket - Womens', Decimal('183912.1200')),
 ('Teal Button Up Shirt - Mens', Decimal('32062.4000'))]

## A-3 What was the total discount amount for all products?

In [9]:
%%sql
SELECT product_name, Round(Sum(s.price * s.qty * s.discount / 100), 0) AS total_discount
FROM   sales s
       INNER JOIN product_details p
               ON s.prod_id = p.product_id
GROUP  BY 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
12 rows affected.

[('Navy Oversized Jeans - Womens', Decimal('6136')),
 ('White Tee Shirt - Mens', Decimal('18378')),
 ('White Striped Socks - Mens', Decimal('7411')),
 ('Pink Fluro Polkadot Socks - Mens', Decimal('12952')),
 ('Cream Relaxed Jeans - Womens', Decimal('4463')),
 ('Indigo Rain Jacket - Womens', Decimal('8643')),
 ('Blue Polo Shirt - Mens', Decimal('26819')),
 ('Navy Solid Socks - Mens', Decimal('16650')),
 ('Black Straight Jeans - Womens', Decimal('14745')),
 ('Khaki Suit Jacket - Womens', Decimal('10243')),
 ('Grey Fashion Jacket - Womens', Decimal('25392')),
 ('Teal Button Up Shirt - Mens', Decimal('4398'))]

## B-1 How many unique transactions were there?

In [11]:
%%sql
SELECT Count(DISTINCT( txn_id )) AS unique_transactions
FROM   sales

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
1 rows affected.

[(2500,)]

## B-2 What is the average unique products purchased in each transaction?

In [12]:
%%sql
WITH sub
     AS (SELECT txn_id,
                Count(DISTINCT( prod_id )) AS distinct_product
         FROM   sales
         GROUP  BY 1)
SELECT Round(Avg(distinct_product), 2) AS Avg_unique_products
FROM   sub

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
1 rows affected.

[(Decimal('6.04'),)]

## B-3 What are the 25th, 50th and 75th percentile values for the revenue per transaction?

In [13]:
%%sql
WITH sub
     AS (SELECT txn_id,Sum(qty * price) AS revenue,
      Row_number() OVER(ORDER BY Sum(qty * price) ) AS rn
         FROM   sales
         GROUP  BY 1) 
    SELECT revenue FROM   sub
WHERE  rn IN (SELECT Max(rn) * 0.25 FROM   sub)
UNION
SELECT revenue FROM   sub
WHERE  rn IN (SELECT Max(rn) * 0.5 FROM   sub)
UNION
SELECT revenue FROM   sub
WHERE  rn IN (SELECT Max(rn) * 0.75 FROM   sub)

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
3 rows affected.

[(Decimal('375'),), (Decimal('509'),), (Decimal('647'),)]

## B-4 What is the average discount value per transaction?

In [14]:
%%sql
WITH sub
     AS (SELECT txn_id, Sum(qty * price * discount) / 100 AS Value_per_trans
         FROM   sales
         GROUP  BY 1)
SELECT Round(Avg(value_per_trans), 2) AS Avg_value_per_trans
FROM   sub

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
1 rows affected.

[(Decimal('62.49'),)]

## B-5 What is the percentage split of all transactions for members vs non-members?

In [15]:
%%sql
SELECT Round(Sum(CASE
                   WHEN member = "t" THEN qty * price
                 END) * 100 / Sum(qty * price), 1) AS members,
       Round(Sum(CASE
                   WHEN member = "f" THEN qty * price
                 END) * 100 / Sum(qty * price), 1) AS Non_members
FROM   sales

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
1 rows affected.

[(Decimal('60.3'), Decimal('39.7'))]

## B-6 What is the average revenue for member transactions and non-member transactions?

In [16]:
%%sql
WITH sub
     AS (SELECT txn_id,member,Sum(qty * price) AS revenue FROM sales 
         GROUP  BY 1,2)
SELECT member, Avg(revenue) FROM   sub
GROUP  BY 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
2 rows affected.

[('t', Decimal('516.2684')), ('f', Decimal('515.0442'))]

## C-1 What are the top 3 products by total revenue before discount?

In [17]:
%%sql
SELECT product_name, Sum(s.qty * s.price) AS revenue
FROM   sales s
       LEFT JOIN product_details p
              ON p.product_id = s.prod_id
GROUP  BY 1
ORDER  BY 2 DESC
LIMIT  3

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
3 rows affected.

[('Blue Polo Shirt - Mens', Decimal('217683')),
 ('Grey Fashion Jacket - Womens', Decimal('209304')),
 ('White Tee Shirt - Mens', Decimal('152000'))]

## C-2 What is the total quantity, revenue and discount for each segment?

In [18]:
%%sql
SELECT segment_id,category_name,segment_name,Sum(s.qty) AS qty_sold,
       Sum(s.qty * s.price) AS Total_revenue,
       Round(Sum(s.qty * s.price * discount / 100), 1) AS total_discount
FROM   sales s
       LEFT JOIN product_details p
              ON p.product_id = s.prod_id
GROUP  BY 1,2,3
ORDER  BY 4

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
4 rows affected.

[(6, 'Mens', 'Socks', Decimal('11217'), Decimal('307977'), Decimal('37013.4')),
 (5, 'Mens', 'Shirt', Decimal('11265'), Decimal('406143'), Decimal('49594.3')),
 (3, 'Womens', 'Jeans', Decimal('11349'), Decimal('208350'), Decimal('25344.0')),
 (4, 'Womens', 'Jacket', Decimal('11385'), Decimal('366983'), Decimal('44277.5'))]

## C-3 What is the top selling product for each segment?

In [19]:
%%sql
WITH sub
     AS (SELECT segment_id,product_name,Sum(s.qty) AS quantity_sold,
                Row_number() OVER(partition BY segment_id ORDER BY Sum(s.qty) DESC ) AS rn
         FROM   sales s
                LEFT JOIN product_details p
                       ON p.product_id = s.prod_id
         GROUP  BY 1,2)
SELECT segment_id,
       product_name,
       quantity_sold
FROM   sub
WHERE  rn = 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
4 rows affected.

[(3, 'Navy Oversized Jeans - Womens', Decimal('3856')),
 (4, 'Grey Fashion Jacket - Womens', Decimal('3876')),
 (5, 'Blue Polo Shirt - Mens', Decimal('3819')),
 (6, 'Navy Solid Socks - Mens', Decimal('3792'))]

## C-4 What is the total quantity, revenue and discount for each category?

In [20]:
%%sql
SELECT category_id,category_name,
       Sum(s.qty) AS qty_sold,Sum(s.qty * s.price) AS Total_revenue,
       Round(Sum(s.qty * s.price * discount / 100), 1) AS total_discount
FROM   sales s
       LEFT JOIN product_details p
              ON p.product_id = s.prod_id
GROUP  BY 1,2
ORDER  BY 4

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
2 rows affected.

[(1, 'Womens', Decimal('22734'), Decimal('575333'), Decimal('69621.4')),
 (2, 'Mens', Decimal('22482'), Decimal('714120'), Decimal('86607.7'))]

## C-5 What is the top selling product for each category?

In [21]:
%%sql
WITH sub
     AS (SELECT category_id,
                product_name, Sum(s.qty) AS quantity_sold,
                Row_number() OVER(partition BY category_id ORDER BY Sum(s.qty) DESC ) AS rn
         FROM   sales s
                LEFT JOIN product_details p
                       ON p.product_id = s.prod_id
         GROUP  BY 1,2)
SELECT category_id,
       product_name,
       quantity_sold
FROM   sub
WHERE  rn = 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
2 rows affected.

[(1, 'Grey Fashion Jacket - Womens', Decimal('3876')),
 (2, 'Blue Polo Shirt - Mens', Decimal('3819'))]

## C-6 What is the percentage split of revenue by product for each segment?

In [22]:
%%sql
WITH sub
     AS (SELECT segment_name,product_name,Sum(s.qty * s.price) AS sep_revenue
         FROM   sales s
                LEFT JOIN product_details p
                       ON p.product_id = s.prod_id
         GROUP  BY 1,2
         ORDER  BY 1)
SELECT segment_name,
       product_name,
       Round(sep_revenue * 100 / Sum(sep_revenue)
                                   OVER(
                                     partition BY segment_name), 0) AS
       revenue_per_each_segment
FROM   sub
GROUP  BY 1,2
ORDER  BY 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
12 rows affected.

[('Jacket', 'Grey Fashion Jacket - Womens', Decimal('57')),
 ('Jacket', 'Indigo Rain Jacket - Womens', Decimal('19')),
 ('Jacket', 'Khaki Suit Jacket - Womens', Decimal('24')),
 ('Jeans', 'Black Straight Jeans - Womens', Decimal('58')),
 ('Jeans', 'Cream Relaxed Jeans - Womens', Decimal('18')),
 ('Jeans', 'Navy Oversized Jeans - Womens', Decimal('24')),
 ('Shirt', 'Blue Polo Shirt - Mens', Decimal('54')),
 ('Shirt', 'Teal Button Up Shirt - Mens', Decimal('9')),
 ('Shirt', 'White Tee Shirt - Mens', Decimal('37')),
 ('Socks', 'Navy Solid Socks - Mens', Decimal('44')),
 ('Socks', 'Pink Fluro Polkadot Socks - Mens', Decimal('35')),
 ('Socks', 'White Striped Socks - Mens', Decimal('20'))]

## C-7 What is the percentage split of revenue by segment for each category?

In [23]:
%%sql
WITH sub
     AS (SELECT segment_name,
                category_name,
                Sum(s.qty * s.price) AS revenue
         FROM   sales s
                LEFT JOIN product_details p
                       ON p.product_id = s.prod_id
         GROUP  BY 1,
                   2
         ORDER  BY 1)
SELECT segment_name,
       category_name,
       Round(revenue * 100 / Sum(revenue)
                               OVER(
                                 partition BY category_name), 0) AS
       revenue_per_each_category
FROM   sub
GROUP  BY 1,
          2
ORDER  BY 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
4 rows affected.

[('Jacket', 'Womens', Decimal('64')),
 ('Jeans', 'Womens', Decimal('36')),
 ('Shirt', 'Mens', Decimal('57')),
 ('Socks', 'Mens', Decimal('43'))]

## C-8 What is the percentage split of total revenue by category?

In [24]:
%%sql
SELECT category_id,
       Round(Sum(s.qty * s.price) * 100 / (SELECT Sum(qty * price)
                                           FROM   sales), 1) AS
       revenue_percentage
FROM   sales s
       LEFT JOIN product_details p
              ON p.product_id = s.prod_id
GROUP  BY 1
ORDER  BY 1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
2 rows affected.

[(1, Decimal('44.6')), (2, Decimal('55.4'))]

## C-9 What is the total transaction “penetration” for each product? (hint: penetration = number of transactions where at least 1 quantity of a product was purchased divided by total number of transactions)

In [25]:
%%sql
WITH sub
     AS (SELECT product_name,
                Count(DISTINCT( txn_id )) AS product_wise_trans
         FROM   sales s
                LEFT JOIN product_details p
                       ON p.product_id = s.prod_id
         GROUP  BY 1
         ORDER  BY 1),
     sub_2
     AS (SELECT Count(DISTINCT( txn_id )) AS Total_transaction
         FROM   sales s
                LEFT JOIN product_details p
                       ON p.product_id = s.prod_id)
SELECT product_name,
       Round(sub.product_wise_trans * 100 / sub_2.total_transaction, 0) AS
       penetration
FROM   sub,
       sub_2

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
12 rows affected.

[('Black Straight Jeans - Womens', Decimal('50')),
 ('Blue Polo Shirt - Mens', Decimal('51')),
 ('Cream Relaxed Jeans - Womens', Decimal('50')),
 ('Grey Fashion Jacket - Womens', Decimal('51')),
 ('Indigo Rain Jacket - Womens', Decimal('50')),
 ('Khaki Suit Jacket - Womens', Decimal('50')),
 ('Navy Oversized Jeans - Womens', Decimal('51')),
 ('Navy Solid Socks - Mens', Decimal('51')),
 ('Pink Fluro Polkadot Socks - Mens', Decimal('50')),
 ('Teal Button Up Shirt - Mens', Decimal('50')),
 ('White Striped Socks - Mens', Decimal('50')),
 ('White Tee Shirt - Mens', Decimal('51'))]

## C-10 What is the most common combination of at least 1 quantity of any 3 products in a 1 single transaction?

In [26]:
%%sql
WITH sub
     AS (SELECT product_name,
                category_name,
                txn_id
         FROM   sales s
                LEFT JOIN product_details p
                       ON p.product_id = s.prod_id
         WHERE  txn_id IN (SELECT txn_id
                           FROM   sales
                           GROUP  BY 1
                           HAVING Count(prod_id) >= 3)),
     sub_2
     AS (SELECT product_name,
                category_name,
                Count(DISTINCT( txn_id ))                     AS No_of_time_sold
                ,
                Row_number()
                  OVER(
                    partition BY category_name
                    ORDER BY Count( DISTINCT(txn_id) ) DESC ) AS Row_num
         FROM   sub
         GROUP  BY 1,
                   2
         ORDER  BY 2)
SELECT product_name,
       category_name,
       no_of_time_sold
FROM   sub_2
WHERE  row_num <= 3

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
6 rows affected.

[('Navy Solid Socks - Mens', 'Mens', 1276),
 ('Blue Polo Shirt - Mens', 'Mens', 1265),
 ('White Tee Shirt - Mens', 'Mens', 1263),
 ('Grey Fashion Jacket - Womens', 'Womens', 1273),
 ('Navy Oversized Jeans - Womens', 'Womens', 1267),
 ('Indigo Rain Jacket - Womens', 'Womens', 1244)]

In [28]:
%%sql
SELECT p.prod_id                   AS Prod_1,
       s.prod_id                   AS Prod_2,
       t.prod_id                   AS Prod_3,
       Count(DISTINCT( p.txn_id )) AS Common_combination
FROM   sales p
       JOIN sales s
         ON p.txn_id = s.txn_id
            AND p.prod_id < s.prod_id
       JOIN sales t
         ON p.txn_id = t.txn_id
            AND s.prod_id < t.prod_id
GROUP  BY 1,
          2,
          3
ORDER  BY 4 DESC
LIMIT  1

 * mysql+pymysql://root:***@localhost:3306/balanced_tree
1 rows affected.

[('5d267b', '9ec847', 'c8d436', 352)]